{
    "title": "Orange Cake with Semolina and Almonds",
    "prep_time": "30 mins",
    "cook_time": "1 hr 20 mins",
    "additional_time": "20 mins",
    "total_time": "2 hrs 10 mins",
    "yield": "10",
    "ingredients": [
        {
            "qty": "2",
            "unit": "large",
            "name": "organic oranges, scrubbed and coarsely chopped (with the skin)"
        },
        {
            "qty": "5",
            "unit": "",
            "name": "eggs, separated"
        },
        {
            "qty": "1",
            "unit": "cup",
            "name": "white sugar, divided"
        },
        {
            "qty": "¾",
            "unit": "cup",
            "name": "ground almonds"
        },
        {
            "qty": "¾",
            "unit": "cup",
            "name": "semolina flour"
        },
        {
            "qty": "½",
            "unit": "teaspoon",
            "name": "vanilla extract"
        },
        {
            "qty": "",
            "unit": "",
            "name": "1/2 teaspoon fiori di Sicilia (optional)"
        },
        {
            "qty": "3",
            "unit": "tablespoons",
            "name": "brandy-based orange liqueur (such as Grand Marnier®)"
        },
        {
            "qty": "½",
            "unit": "teaspoon",
            "name": "confectioners' sugar (Optional)"
        }
    ],
    "steps": [
        {
            "step_number": 1,
            "text": "Combine chopped oranges and 1 tablespoon water in a small saucepan, cover, and cook over medium-low heat until oranges are soft and excess liquid has evaporated, about 30 minutes. Set aside to cool, about 20 minutes.",
            "substeps": [
                {
                    "sub_number": "1.1",
                    "text": "Combine chopped oranges and 1 tablespoon water in a small saucepan, cover, and cook over medium-low heat until oranges are soft and excess liquid has evaporated, about 30 minutes."
                },
                {
                    "sub_number": "1.2",
                    "text": "Set aside to cool, about 20 minutes."
                }
            ]
        },
        {
            "step_number": 2,
            "text": "Preheat oven to 350 degrees F (175 degrees C). Line the bottom and sides of an 8-inch springform pan with parchment paper.",
            "substeps": [
                {
                    "sub_number": "2.1",
                    "text": "Preheat oven to 350 degrees F (175 degrees C)."
                },
                {
                    "sub_number": "2.2",
                    "text": "Line the bottom and sides of an 8-inch springform pan with parchment paper."
                }
            ]
        },
        {
            "step_number": 3,
            "text": "Place oranges in the bowl of a food processor; pulse until finely chopped.",
            "substeps": [
                {
                    "sub_number": "3.1",
                    "text": "Place oranges in the bowl of a food processor; pulse until finely chopped."
                }
            ]
        },
        {
            "step_number": 4,
            "text": "Beat egg whites in a glass, metal, or ceramic bowl until stiff peaks form. Gradually add 1/2 cup sugar, continuing to beat for 1 more minute.",
            "substeps": [
                {
                    "sub_number": "4.1",
                    "text": "Beat egg whites in a glass, metal, or ceramic bowl until stiff peaks form."
                },
                {
                    "sub_number": "4.2",
                    "text": "Gradually add 1/2 cup sugar, continuing to beat for 1 more minute."
                }
            ]
        },
        {
            "step_number": 5,
            "text": "Beat egg yolks and remaining 1/2 cup sugar in a separate bowl until pale and thick, 2 to 3 minutes. Whisk in finely chopped oranges. Fold in ground almonds, semolina, vanilla extract, and fiori di Sicilia. Stir in 3 spoonfuls of whisked egg white to loosen the batter. Gently fold in remaining egg whites with a spatula or large metal spoon. Pour batter into prepared springform and level the top.",
            "substeps": [
                {
                    "sub_number": "5.1",
                    "text": "Beat egg yolks and remaining 1/2 cup sugar in a separate bowl until pale and thick, 2 to 3 minutes."
                },
                {
                    "sub_number": "5.2",
                    "text": "Whisk in finely chopped oranges."
                },
                {
                    "sub_number": "5.3",
                    "text": "Fold in ground almonds, semolina, vanilla extract, and fiori di Sicilia."
                },
                {
                    "sub_number": "5.4",
                    "text": "Stir in 3 spoonfuls of whisked egg white to loosen the batter."
                },
                {
                    "sub_number": "5.5",
                    "text": "Gently fold in remaining egg whites with a spatula or large metal spoon."
                },
                {
                    "sub_number": "5.6",
                    "text": "Pour batter into prepared springform and level the top."
                }
            ]
        },
        {
            "step_number": 6,
            "text": "Bake in the preheated oven until cake is golden and a skewer inserted in the center comes out clean, about 50 minutes. Check cake after 20 and 30 minutes to see if it is starting to brown too quickly. Cover top lightly with aluminum foil once cake starts to brown.",
            "substeps": [
                {
                    "sub_number": "6.1",
                    "text": "Bake in the preheated oven until cake is golden and a skewer inserted in the center comes out clean, about 50 minutes."
                },
                {
                    "sub_number": "6.2",
                    "text": "Check cake after 20 and 30 minutes to see if it is starting to brown too quickly."
                },
                {
                    "sub_number": "6.3",
                    "text": "Cover top lightly with aluminum foil once cake starts to brown."
                }
            ]
        },
        {
            "step_number": 7,
            "text": "Remove from oven and cool in the pan. Remove ring, peel away parchment paper and transfer cake to a serving plate. Drizzle with liqueur and dust with confectioners' sugar.",
            "substeps": [
                {
                    "sub_number": "7.1",
                    "text": "Remove from oven and cool in the pan."
                },
                {
                    "sub_number": "7.2",
                    "text": "Remove ring, peel away parchment paper and transfer cake to a serving plate."
                },
                {
                    "sub_number": "7.3",
                    "text": "Drizzle with liqueur and dust with confectioners' sugar."
                }
            ]
        }
    ]
}